
"""
Ожидаемый вывод (примерно), хотя если точно, то будет супер.
(Внимание! Количество символов # не равняется числу справа,
а просто ориентировочно по формуле зависит от него.)

Формула процентов (любое значение/самое большое значение * 100).

Mon: ##################### (30)
Tue: ###########__________ (15)
Wed: #____________________ ( 1)
Thu: #################____ (25)
Fri: ####_________________ ( 5)
Sat: ###################__ (28)
"""

subs = [30, 15, 1, 25, 5, 28]
days = ("Mon", "Tue", "Wed", "Thu", "Fri", "Sat")

max_day = max(subs)  # Самое максимальное значение из всех

# Код тут.

SCALE_LENGTH = 20  # Например

i = 0

while i < len(subs):
    coefficient = round(SCALE_LENGTH * (subs[i] / max_day))

    print(
        f'{days[i]}: {'#' * coefficient}{'_' * (SCALE_LENGTH - coefficient)} ({subs[i]:2d})')

    i += 1
