"""
ТУТ еще пусто. Будет в следующей лекции отдельная директория под
разработку клиента. Точно так же как было с этим сервером. Подробности
узнаете в следующей лекции.

Если есть желание и ВРЕМЯ, то можете попробовать сами написать клиент для сервера,
который есть на данный момент.
Но имейте в виду, что в следующей лекции я буду писать клиент и еще дорабатывать
сервер, как финальная часть "подгонки". Будет рассмотрено ещё много моментов
на тему Keep Alive, тайм-аутов и прочего, что самостоятельно делать прямо сейчас
без следующей лекции будет возможно не так просто. Так что я бы советовал просто
идти в следующую лекцию. Конечно просмотрев код сервера, возможно поделав
одиночные запросы на него по желанию.
"""


